trans.addDict([
    [300, 0, "monitor"], [300, 1, "мониторинг"],
    [301, 0, "measurement history"], [301, 1, "история измерений"],
    [302, 0, "time"], [302, 1, "время"],
    [303, 0, "start"], [303, 1, "старт"],
    [304, 0, "stop"], [304, 1, "стоп"],
    [305, 0, "reset"], [305, 1, "сброс"],
    [306, 0, "state"], [306, 1, "состояние"],
    [307, 0, "data"], [307, 1, "данные"],
    [308, 0, "help"], [308, 1, "помощь"],
    [309, 0, "measurement check"], [309, 1, "проверка измерений"],
    [310, 0, "equipment check"], [310, 1, "проверка оборудования"],
    [311, 0, "message"], [311, 1, "сообщение"],
    [312, 0, "delete"], [312, 1, "удалить"],
    [313, 0, "delete all"], [313, 1, "удалить все"],
    [314, 0, "update"], [314, 1, "обновить"],
    [315, 0, "group"], [315, 1, "группа"],
    [316, 0, "number"], [316, 1, "номер"],
    [317, 0, "log"], [317, 1, "журнал"],
    [318, 0, "control"], [318, 1, "управление"],
    [319, 0, "settings"], [319, 1, "настройки"],
    [320, 0, "add"], [320, 1, "добавить"],
    [321, 0, "order"], [321, 1, "очередность"],
    [322, 0, "parameter checker settings"], [322, 1, "настройки контроля параметров"],
    [323, 0, "parameter checker programs"], [323, 1, "программы контроля параметров"],
    [324, 0, "start"], [324, 1, "запуск"],
    [325, 0, "stop"], [325, 1, "останов"],
    [326, 0, "reset"], [326, 1, "перезапуск"],
    [327, 0, "enable"], [327, 1, "активировать"],
    [328, 0, "disable"], [328, 1, "деактивировать"],
    [329, 0, "get enabled"], [329, 1, "активна"],
    [330, 0, "get run"], [330, 1, "параметры вв"],
    [331, 0, "get init"], [331, 1, "параметры и"],
    [332, 0, "prog ids"], [332, 1, "идентификаторы программ"],

]);

//menu
trans.addDict([
    [401, 0, "bumble-bee culture"], [401, 1, "шмелеводство"],
    [402, 0, "help"], [402, 1, "помощь"],
    [403, 0, "equipment"], [403, 1, "оборудование"],
    [404, 0, "alerts"], [404, 1, "тревоги"],
    [405, 0, "climate control"], [405, 1, "управление климатом"],
    [406, 0, "alerts history"], [406, 1, "журнал тревог"],
    [407, 0, "phone numbers"], [407, 1, "номера телефонов"],
    [408, 0, "measurement check"], [408, 1, "проверка измерений"],
    [409, 0, "equipment check"], [409, 1, "проверка оборудования"],
    [410, 0, "registrator"], [410, 1, "регистратор"]
]);

//error
trans.addDict([
    [250, 0, "failed to get data from database"], [250, 1, "не удалось получить данные из базы данных"],
    [251, 0, "failed to send command to controller"], [251, 1, "не удалось отправить команду контроллеру"],
    [252, 0, "controller is active and ready for valve control"], [252, 1, "контроллер активен и готов к выполнению команд на управление клапанами"],
    [253, 0, "controller is at standby mode and not ready for valve control"], [253, 1, "контроллер находится в режиме ожидания и не готов управлять клапанами"],
    [254, 0, "failed to get response from controller"], [254, 1, "не удалось получить ответ от контроллера"],
    [255, 0, "unknown response from controller"], [255, 1, "неизвестный ответ от контроллера"],
    [256, 0, "broken connection with one of modules"], [256, 1, "нет связи с одним из модулей"],
    [257, 0, "failed to save"], [257, 1, "не удалось сохранить"]
]);